{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1024_c",
   "name" : "char[1024]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA1024_c",
   "size" : 1024,
   "source_file" : "system/libbase/include/android-base/file.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA175_h",
   "name" : "unsigned char[175]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA175_h",
   "size" : 175,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_N3fmt3v106detail4typeE",
   "name" : "fmt::detail::type[1]",
   "referenced_type" : "_ZTIN3fmt3v106detail4typeE",
   "self_type" : "_ZTIA1_N3fmt3v106detail4typeE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 16,
   "linker_set_key" : "_ZTIA1_N3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "name" : "fmt::detail::value<fmt::basic_format_context<fmt::appender, char>>[1]",
   "referenced_type" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "self_type" : "_ZTIA1_N3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_PFPKcRN3fmt3v106detail21compile_parse_contextIcEEE",
   "name" : "const char *(*[1])(fmt::detail::compile_parse_context<char> &)",

   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIPKcNS_9allocatorIS2_EEEE",
   "name" : "const std::vector<const char *, std::allocator<const char *>>",
   "referenced_type" : "_ZTINSt3__16vectorIPKcNS_9allocatorIS2_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorIPKcNS_9allocatorIS2_EEEE",
   "size" : 24,
   "source_file" : "system/libbase/include/android-base/strings.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorIiNS_9allocatorIiEEEE",
   "name" : "const std::vector<int, std::allocator<int>>",
   "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE",
   "self_type" : "_ZTIKNSt3__16vectorIiNS_9allocatorIiEEEE",
   "size" : 24,
   "source_file" : "system/libbase/include/android-base/cmsg.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__19allocatorIcEE",
   "name" : "const std::allocator<char>",
   "referenced_type" : "_ZTINSt3__19allocatorIcEE",
   "self_type" : "_ZTIKNSt3__19allocatorIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__19allocatorIiEE",
   "name" : "const std::allocator<int>",
   "referenced_type" : "_ZTINSt3__19allocatorIiEE",
   "self_type" : "_ZTIKNSt3__19allocatorIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__19allocatorIjEE",
   "name" : "const std::allocator<unsigned int>",
   "referenced_type" : "_ZTINSt3__19allocatorIjEE",
   "self_type" : "_ZTIKNSt3__19allocatorIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__19allocatorIwEE",
   "name" : "const std::allocator<wchar_t>",
   "referenced_type" : "_ZTINSt3__19allocatorIwEE",
   "self_type" : "_ZTIKNSt3__19allocatorIwEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKv",
   "name" : "const void *const",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIKPKv",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "_ZTIKe",
   "name" : "const long double",
   "referenced_type" : "_ZTIe",
   "self_type" : "_ZTIKe",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/errno_restorer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/libbase/include/android-base/cmsg.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "path",
     "referenced_type" : "_ZTIA1024_c"
    },
    {
     "access" : "private",
     "field_name" : "remove_dir_and_contents_",
     "field_offset" : 8192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI12TemporaryDir",
   "name" : "TemporaryDir",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12TemporaryDir",
   "self_type" : "_ZTI12TemporaryDir",
   "size" : 1025,
   "source_file" : "system/libbase/include/android-base/file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "temp_file_",
     "referenced_type" : "_ZTI13TemporaryFile"
    },
    {
     "access" : "private",
     "field_name" : "std_fd_",
     "field_offset" : 8256,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "old_fd_",
     "field_offset" : 8288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI13CapturedStdFd",
   "name" : "CapturedStdFd",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13CapturedStdFd",
   "self_type" : "_ZTI13CapturedStdFd",
   "size" : 1040,
   "source_file" : "system/libbase/include/android-base/test_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "path",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1024_c"
    },
    {
     "access" : "private",
     "field_name" : "remove_file_",
     "field_offset" : 8224,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI13TemporaryFile",
   "name" : "TemporaryFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13TemporaryFile",
   "self_type" : "_ZTI13TemporaryFile",
   "size" : 1032,
   "source_file" : "system/libbase/include/android-base/file.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI13CapturedStdFd"
    }
   ],
   "linker_set_key" : "_ZTI14CapturedStderr",
   "name" : "CapturedStderr",
   "record_kind" : "class",
   "referenced_type" : "_ZTI14CapturedStderr",
   "self_type" : "_ZTI14CapturedStderr",
   "size" : 1040,
   "source_file" : "system/libbase/include/android-base/test_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI13CapturedStdFd"
    }
   ],
   "linker_set_key" : "_ZTI14CapturedStdout",
   "name" : "CapturedStdout",
   "record_kind" : "class",
   "referenced_type" : "_ZTI14CapturedStdout",
   "self_type" : "_ZTI14CapturedStdout",
   "size" : 1040,
   "source_file" : "system/libbase/include/android-base/test_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTIA22_c"
    },
    {
     "access" : "private",
     "field_name" : "str_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1010format_intE",
   "name" : "fmt::format_int",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1010format_intE",
   "self_type" : "_ZTIN3fmt3v1010format_intE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt13runtime_error"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1012format_errorE",
   "name" : "fmt::format_error",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1012format_errorE",
   "self_type" : "_ZTIN3fmt3v1012format_errorE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1012format_errorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt3v1012format_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt3v1012format_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "separator_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "grouping_",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "decimal_point_",
     "field_offset" : 512,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1012format_facetINSt3__16localeEEE",
   "name" : "fmt::format_facet<std::locale>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1012format_facetINSt3__16localeEEE",
   "self_type" : "_ZTIN3fmt3v1012format_facetINSt3__16localeEEE",
   "size" : 88,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTINSt3__16localeE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1012format_facetINSt3__16localeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt3v1012format_facetINSt3__16localeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt3v1012format_facetINSt3__16localeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNK3fmt3v1012format_facetINSt3__16localeEE6do_putENS0_8appenderENS0_9loc_valueERKNS0_12format_specsIcEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "precision",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v1017presentation_typeE"
    },
    {
     "field_name" : "align",
     "field_offset" : 72,
     "referenced_type" : "_ZTIN3fmt3v105align4typeE"
    },
    {
     "field_name" : "sign",
     "field_offset" : 76,
     "referenced_type" : "_ZTIN3fmt3v104sign4typeE"
    },
    {
     "field_name" : "alt",
     "field_offset" : 79,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "localized",
     "field_offset" : 80,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "fill",
     "field_offset" : 88,
     "referenced_type" : "_ZTIN3fmt3v106detail6fill_tIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1012format_specsIcEE",
   "name" : "fmt::format_specs<>",
   "referenced_type" : "_ZTIN3fmt3v1012format_specsIcEE",
   "self_type" : "_ZTIN3fmt3v1012format_specsIcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1013is_contiguousINS0_6detail6bufferIcEEEE",
   "name" : "fmt::is_contiguous<fmt::detail::buffer<char>>",
   "referenced_type" : "_ZTIN3fmt3v1013is_contiguousINS0_6detail6bufferIcEEEE",
   "self_type" : "_ZTIN3fmt3v1013is_contiguousINS0_6detail6bufferIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail6bufferIcEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v1013type_identityIRA3_KcEE",
   "name" : "fmt::type_identity<const char (&)[3]>",
   "referenced_type" : "_ZTIN3fmt3v1013type_identityIRA3_KcEE",
   "self_type" : "_ZTIN3fmt3v1013type_identityIRA3_KcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRA3_Kc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v1013type_identityIRA7_KcEE",
   "name" : "fmt::type_identity<const char (&)[7]>",
   "referenced_type" : "_ZTIN3fmt3v1013type_identityIRA7_KcEE",
   "self_type" : "_ZTIN3fmt3v1013type_identityIRA7_KcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRA7_Kc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v1013type_identityIRNS0_17basic_string_viewIcEEEE",
   "name" : "fmt::type_identity<fmt::basic_string_view<char> &>",
   "referenced_type" : "_ZTIN3fmt3v1013type_identityIRNS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt3v1013type_identityIRNS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v1013type_identityIRiEE",
   "name" : "fmt::type_identity<int &>",
   "referenced_type" : "_ZTIN3fmt3v1013type_identityIRiEE",
   "self_type" : "_ZTIN3fmt3v1013type_identityIRiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v1013type_identityIRjEE",
   "name" : "fmt::type_identity<unsigned int &>",
   "referenced_type" : "_ZTIN3fmt3v1013type_identityIRjEE",
   "self_type" : "_ZTIN3fmt3v1013type_identityIRjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v1013type_identityIcEE",
   "name" : "fmt::type_identity<char>",
   "referenced_type" : "_ZTIN3fmt3v1013type_identityIcEE",
   "self_type" : "_ZTIN3fmt3v1013type_identityIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v1013type_identityIiEE",
   "name" : "fmt::type_identity<int>",
   "referenced_type" : "_ZTIN3fmt3v1013type_identityIiEE",
   "self_type" : "_ZTIN3fmt3v1013type_identityIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "custom_",
     "referenced_type" : "_ZTIN3fmt3v106detail12custom_valueINS0_20basic_format_contextINS0_8appenderEcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEE6handleE",
   "name" : "fmt::basic_format_arg<fmt::basic_format_context<fmt::appender, char>>::handle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEE6handleE",
   "self_type" : "_ZTIN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEE6handleE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value_",
     "referenced_type" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "type_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt3v106detail4typeE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "name" : "fmt::basic_format_arg<fmt::basic_format_context<fmt::appender, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "self_type" : "_ZTIN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm2ELm0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJA7_ciEEE",
   "name" : "fmt::format_arg_store<fmt::basic_format_context<fmt::appender, char>, char[7], int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJA7_ciEEE",
   "self_type" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJA7_ciEEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm0ELm0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJEEE",
   "name" : "fmt::format_arg_store<fmt::basic_format_context<fmt::appender, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJEEE",
   "self_type" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm2ELm0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJNS0_17basic_string_viewIcEEA3_cEEE",
   "name" : "fmt::format_arg_store<fmt::basic_format_context<fmt::appender, char>, basic_string_view<char>, char[3]>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJNS0_17basic_string_viewIcEEA3_cEEE",
   "self_type" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJNS0_17basic_string_viewIcEEA3_cEEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm1ELm0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJiEEE",
   "name" : "fmt::format_arg_store<fmt::basic_format_context<fmt::appender, char>, int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJiEEE",
   "self_type" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJiEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm1ELm0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJjEEE",
   "name" : "fmt::format_arg_store<fmt::basic_format_context<fmt::appender, char>, unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJjEEE",
   "self_type" : "_ZTIN3fmt3v1016format_arg_storeINS0_20basic_format_contextINS0_8appenderEcEEJjEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "desc_",
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<fmt::appender, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "self_type" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "values_",
     "referenced_type" : "_ZTIPKN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE"
    },
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIPKN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEUt_E",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<fmt::appender, char>>::(anonymous)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEUt_E",
   "self_type" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEUt_E",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKDu"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1017basic_string_viewIDuEE",
   "name" : "fmt::basic_string_view<char8_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIDuEE",
   "self_type" : "_ZTIN3fmt3v1017basic_string_viewIDuEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIDu"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1017basic_string_viewIcEE",
   "name" : "fmt::basic_string_view<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE",
   "self_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKw"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1017basic_string_viewIwEE",
   "name" : "fmt::basic_string_view<wchar_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIwEE",
   "self_type" : "_ZTIN3fmt3v1017basic_string_viewIwEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "str_",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_format_stringIcJEEE",
   "name" : "fmt::basic_format_string<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1019basic_format_stringIcJEEE",
   "self_type" : "_ZTIN3fmt3v1019basic_format_stringIcJEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "str_",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_format_stringIcJRA7_KcRiEEE",
   "name" : "fmt::basic_format_string<char, const char (&)[7], int &>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1019basic_format_stringIcJRA7_KcRiEEE",
   "self_type" : "_ZTIN3fmt3v1019basic_format_stringIcJRA7_KcRiEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "str_",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_format_stringIcJRNS0_17basic_string_viewIcEERA3_KcEEE",
   "name" : "fmt::basic_format_string<char, basic_string_view<char> &, const char (&)[3]>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1019basic_format_stringIcJRNS0_17basic_string_viewIcEERA3_KcEEE",
   "self_type" : "_ZTIN3fmt3v1019basic_format_stringIcJRNS0_17basic_string_viewIcEERA3_KcEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "str_",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_format_stringIcJRjEEE",
   "name" : "fmt::basic_format_string<char, unsigned int &>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1019basic_format_stringIcJRjEEE",
   "self_type" : "_ZTIN3fmt3v1019basic_format_stringIcJRjEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "str_",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_format_stringIcJiEEE",
   "name" : "fmt::basic_format_string<char, int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1019basic_format_stringIcJiEEE",
   "self_type" : "_ZTIN3fmt3v1019basic_format_stringIcJiEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA500_c"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "referenced_type" : "_ZTINSt3__19allocatorIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEE",
   "name" : "fmt::basic_memory_buffer<char, 500, std::allocator<char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1019basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEE",
   "self_type" : "_ZTIN3fmt3v1019basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEE",
   "size" : 536,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTINSt3__19allocatorIcEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1019basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v1019basic_memory_bufferIcLm500ENSt3__19allocatorIcEEE4growEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIiEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA500_i"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "referenced_type" : "_ZTINSt3__19allocatorIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_memory_bufferIiLm500ENSt3__19allocatorIiEEEE",
   "name" : "fmt::basic_memory_buffer<int, 500, std::allocator<int>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1019basic_memory_bufferIiLm500ENSt3__19allocatorIiEEEE",
   "self_type" : "_ZTIN3fmt3v1019basic_memory_bufferIiLm500ENSt3__19allocatorIiEEEE",
   "size" : 2032,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTINSt3__19allocatorIiEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1019basic_memory_bufferIiLm500ENSt3__19allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v1019basic_memory_bufferIiLm500ENSt3__19allocatorIiEEE4growEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIjEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA32_j"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "referenced_type" : "_ZTINSt3__19allocatorIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_memory_bufferIjLm32ENSt3__19allocatorIjEEEE",
   "name" : "fmt::basic_memory_buffer<unsigned int, 32, std::allocator<unsigned int>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1019basic_memory_bufferIjLm32ENSt3__19allocatorIjEEEE",
   "self_type" : "_ZTIN3fmt3v1019basic_memory_bufferIjLm32ENSt3__19allocatorIjEEEE",
   "size" : 160,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTINSt3__19allocatorIjEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1019basic_memory_bufferIjLm32ENSt3__19allocatorIjEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v1019basic_memory_bufferIjLm32ENSt3__19allocatorIjEEE4growEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIwEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA500_w"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "referenced_type" : "_ZTINSt3__19allocatorIwEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_memory_bufferIwLm500ENSt3__19allocatorIwEEEE",
   "name" : "fmt::basic_memory_buffer<wchar_t, 500, std::allocator<wchar_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1019basic_memory_bufferIwLm500ENSt3__19allocatorIwEEEE",
   "self_type" : "_ZTIN3fmt3v1019basic_memory_bufferIwLm500ENSt3__19allocatorIwEEEE",
   "size" : 2032,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIw",
    "_ZTINSt3__19allocatorIwEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1019basic_memory_bufferIwLm500ENSt3__19allocatorIwEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v1019basic_memory_bufferIwLm500ENSt3__19allocatorIwEEE4growEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "out_",
     "referenced_type" : "_ZTIN3fmt3v108appenderE"
    },
    {
     "access" : "private",
     "field_name" : "args_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "loc_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN3fmt3v106detail10locale_refE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE",
   "name" : "fmt::basic_format_context<fmt::appender, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE",
   "self_type" : "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v108appenderE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "str",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1021runtime_format_stringIcEE",
   "name" : "fmt::runtime_format_string<>",
   "referenced_type" : "_ZTIN3fmt3v1021runtime_format_stringIcEE",
   "self_type" : "_ZTIN3fmt3v1021runtime_format_stringIcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "format_str_",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    },
    {
     "access" : "private",
     "field_name" : "next_arg_id_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1026basic_format_parse_contextIcEE",
   "name" : "fmt::basic_format_parse_context<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v1026basic_format_parse_contextIcEE",
   "self_type" : "_ZTIN3fmt3v1026basic_format_parse_contextIcEE",
   "size" : 24,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v105bytesE",
   "name" : "fmt::bytes",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v105bytesE",
   "self_type" : "_ZTIN3fmt3v105bytesE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail10arg_mapperINS0_20basic_format_contextINS0_8appenderEcEEE11formattableIKNS0_9monostateES8_EE",
   "name" : "fmt::detail::arg_mapper<fmt::basic_format_context<fmt::appender, char>>::formattable<const fmt::monostate, fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt3v106detail10arg_mapperINS0_20basic_format_contextINS0_8appenderEcEEE11formattableIKNS0_9monostateES8_EE",
   "self_type" : "_ZTIN3fmt3v106detail10arg_mapperINS0_20basic_format_contextINS0_8appenderEcEEE11formattableIKNS0_9monostateES8_EE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIKN3fmt3v109monostateE",
    "_ZTIN3fmt3v109monostateE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail10arg_mapperINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "name" : "fmt::detail::arg_mapper<fmt::basic_format_context<fmt::appender, char>>",
   "referenced_type" : "_ZTIN3fmt3v106detail10arg_mapperINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "self_type" : "_ZTIN3fmt3v106detail10arg_mapperINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "out",
     "referenced_type" : "_ZTIN3fmt3v108appenderE"
    },
    {
     "field_name" : "specs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRKN3fmt3v1012format_specsIcEE"
    },
    {
     "field_name" : "sep",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "grouping",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "decimal_point",
     "field_offset" : 512,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail10loc_writerIcEE",
   "name" : "fmt::detail::loc_writer<>",
   "referenced_type" : "_ZTIN3fmt3v106detail10loc_writerIcEE",
   "self_type" : "_ZTIN3fmt3v106detail10loc_writerIcEE",
   "size" : 88,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "locale_",
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail10locale_refE",
   "name" : "fmt::detail::locale_ref",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail10locale_refE",
   "self_type" : "_ZTIN3fmt3v106detail10locale_refE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIA3_cvEE",
   "name" : "fmt::detail::char_t_impl<char[3]>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIA3_cvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIA3_cvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIA7_cvEE",
   "name" : "fmt::detail::char_t_impl<char[7]>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIA7_cvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIA7_cvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implINS0_17basic_string_viewIcEEvEE",
   "name" : "fmt::detail::char_t_impl<fmt::basic_string_view<char>, void>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implINS0_17basic_string_viewIcEEvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implINS0_17basic_string_viewIcEEvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implINS0_9monostateEvEE",
   "name" : "fmt::detail::char_t_impl<fmt::monostate, void>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implINS0_9monostateEvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implINS0_9monostateEvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v109monostateE",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIPKcvEE",
   "name" : "fmt::detail::char_t_impl<const char *>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIPKcvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIPKcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIPKvvEE",
   "name" : "fmt::detail::char_t_impl<const void *>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIPKvvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIPKvvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIbvEE",
   "name" : "fmt::detail::char_t_impl<bool>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIbvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIbvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIcvEE",
   "name" : "fmt::detail::char_t_impl<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIcvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIdvEE",
   "name" : "fmt::detail::char_t_impl<double>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIdvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIdvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIevEE",
   "name" : "fmt::detail::char_t_impl<long double>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIevEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIevEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIfvEE",
   "name" : "fmt::detail::char_t_impl<float>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIfvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIfvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIhvEE",
   "name" : "fmt::detail::char_t_impl<unsigned char>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIhvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIhvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIh",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIivEE",
   "name" : "fmt::detail::char_t_impl<int>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIivEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIivEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIjvEE",
   "name" : "fmt::detail::char_t_impl<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIjvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIjvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implInvEE",
   "name" : "fmt::detail::char_t_impl<__int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implInvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implInvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIn",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIovEE",
   "name" : "fmt::detail::char_t_impl<unsigned __int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIovEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIovEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIo",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIxvEE",
   "name" : "fmt::detail::char_t_impl<long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIxvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIxvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11char_t_implIyvEE",
   "name" : "fmt::detail::char_t_impl<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail11char_t_implIyvEE",
   "self_type" : "_ZTIN3fmt3v106detail11char_t_implIyvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "precision",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt3v106detail12float_formatE"
    },
    {
     "field_name" : "sign",
     "field_offset" : 40,
     "referenced_type" : "_ZTIN3fmt3v104sign4typeE"
    },
    {
     "field_name" : "upper",
     "field_offset" : 48,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "locale",
     "field_offset" : 49,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "binary32",
     "field_offset" : 50,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "showpoint",
     "field_offset" : 51,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11float_specsE",
   "name" : "fmt::detail::float_specs",
   "referenced_type" : "_ZTIN3fmt3v106detail11float_specsE",
   "self_type" : "_ZTIN3fmt3v106detail11float_specsE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIN3fmt3v1016basic_format_argINS2_20basic_format_contextINS2_8appenderEcEEE6handleEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralINS0_16basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEE6handleEEE",
   "name" : "fmt::detail::is_integral<fmt::basic_format_arg<fmt::basic_format_context<fmt::appender, char>>::handle>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralINS0_16basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEE6handleEEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralINS0_16basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEE6handleEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEE6handleE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIN3fmt3v1017basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::is_integral<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIN3fmt3v109monostateEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralINS0_9monostateEEE",
   "name" : "fmt::detail::is_integral<fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralINS0_9monostateEEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralINS0_9monostateEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v109monostateE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIPKcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIPKcEE",
   "name" : "fmt::detail::is_integral<const char *>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIPKcEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIPKcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIPKvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIPKvEE",
   "name" : "fmt::detail::is_integral<const void *>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIPKvEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIPKvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIbEE",
   "name" : "fmt::detail::is_integral<bool>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIbEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIbEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIcEE",
   "name" : "fmt::detail::is_integral<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIcEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIdEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIdEE",
   "name" : "fmt::detail::is_integral<double>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIdEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIeEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIeEE",
   "name" : "fmt::detail::is_integral<long double>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIeEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIeEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIfEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIfEE",
   "name" : "fmt::detail::is_integral<float>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIfEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIhEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIhEE",
   "name" : "fmt::detail::is_integral<unsigned char>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIhEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIhEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIiEE",
   "name" : "fmt::detail::is_integral<int>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIiEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIjEE",
   "name" : "fmt::detail::is_integral<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIjEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralImEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralImEE",
   "name" : "fmt::detail::is_integral<unsigned long>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralImEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralImEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralInEE",
   "name" : "fmt::detail::is_integral<int128_opt>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralInEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralInEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIoEE",
   "name" : "fmt::detail::is_integral<uint128_t>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIoEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIoEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIo"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIxEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIxEE",
   "name" : "fmt::detail::is_integral<long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIxEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIxEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIyEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIyEE",
   "name" : "fmt::detail::is_integral<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail11is_integralIyEE",
   "self_type" : "_ZTIN3fmt3v106detail11is_integralIyEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvRN3fmt3v1026basic_format_parse_contextIcEERNS1_20basic_format_contextINS1_8appenderEcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12custom_valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "name" : "fmt::detail::custom_value<fmt::basic_format_context<fmt::appender, char>>",
   "referenced_type" : "_ZTIN3fmt3v106detail12custom_valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "self_type" : "_ZTIN3fmt3v106detail12custom_valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12has_isfiniteIdvEE",
   "name" : "fmt::detail::has_isfinite<double>",
   "referenced_type" : "_ZTIN3fmt3v106detail12has_isfiniteIdvEE",
   "self_type" : "_ZTIN3fmt3v106detail12has_isfiniteIdvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12has_isfiniteIevEE",
   "name" : "fmt::detail::has_isfinite<long double>",
   "referenced_type" : "_ZTIN3fmt3v106detail12has_isfiniteIevEE",
   "self_type" : "_ZTIN3fmt3v106detail12has_isfiniteIevEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIe",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12has_isfiniteIfvEE",
   "name" : "fmt::detail::has_isfinite<float>",
   "referenced_type" : "_ZTIN3fmt3v106detail12has_isfiniteIfvEE",
   "self_type" : "_ZTIN3fmt3v106detail12has_isfiniteIfvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIf",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIA3_cEE",
   "name" : "fmt::detail::is_named_arg<char[3]>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIA3_cEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIA3_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIA7_cEE",
   "name" : "fmt::detail::is_named_arg<char[7]>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIA7_cEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIA7_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::is_named_arg<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argINS0_9monostateEEE",
   "name" : "fmt::detail::is_named_arg<fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argINS0_9monostateEEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argINS0_9monostateEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v109monostateE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIPKcEE",
   "name" : "fmt::detail::is_named_arg<const char *>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIPKcEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIPKcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIPKvEE",
   "name" : "fmt::detail::is_named_arg<const void *>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIPKvEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIPKvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIRA3_KcEE",
   "name" : "fmt::detail::is_named_arg<const char (&)[3]>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIRA3_KcEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIRA3_KcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRA3_Kc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIRA7_KcEE",
   "name" : "fmt::detail::is_named_arg<const char (&)[7]>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIRA7_KcEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIRA7_KcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRA7_Kc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIRNS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::is_named_arg<fmt::basic_string_view<char> &>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIRNS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIRNS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIRiEE",
   "name" : "fmt::detail::is_named_arg<int &>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIRiEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIRiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIRjEE",
   "name" : "fmt::detail::is_named_arg<unsigned int &>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIRjEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIRjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIbEE",
   "name" : "fmt::detail::is_named_arg<bool>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIbEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIbEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIcEE",
   "name" : "fmt::detail::is_named_arg<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIcEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIdEE",
   "name" : "fmt::detail::is_named_arg<double>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIdEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIeEE",
   "name" : "fmt::detail::is_named_arg<long double>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIeEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIeEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIfEE",
   "name" : "fmt::detail::is_named_arg<float>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIfEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIhEE",
   "name" : "fmt::detail::is_named_arg<unsigned char>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIhEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIhEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIiEE",
   "name" : "fmt::detail::is_named_arg<int>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIiEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIjEE",
   "name" : "fmt::detail::is_named_arg<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIjEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argInEE",
   "name" : "fmt::detail::is_named_arg<__int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argInEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argInEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIoEE",
   "name" : "fmt::detail::is_named_arg<unsigned __int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIoEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIoEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIo"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIxEE",
   "name" : "fmt::detail::is_named_arg<long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIxEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIxEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12is_named_argIyEE",
   "name" : "fmt::detail::is_named_arg<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail12is_named_argIyEE",
   "self_type" : "_ZTIN3fmt3v106detail12is_named_argIyEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12string_valueIcEE",
   "name" : "fmt::detail::string_value<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail12string_valueIcEE",
   "self_type" : "_ZTIN3fmt3v106detail12string_valueIcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail12vformat_argsIcEE",
   "name" : "fmt::detail::vformat_args<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail12vformat_argsIcEE",
   "self_type" : "_ZTIN3fmt3v106detail12vformat_argsIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "out",
     "referenced_type" : "_ZTIN3fmt3v108appenderE"
    },
    {
     "field_name" : "specs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRKN3fmt3v1012format_specsIcEE"
    },
    {
     "field_name" : "locale",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt3v106detail10locale_refE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13arg_formatterIcEE",
   "name" : "fmt::detail::arg_formatter<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13arg_formatterIcEE",
   "self_type" : "_ZTIN3fmt3v106detail13arg_formatterIcEE",
   "size" : 24,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail13buffer_traitsE",
   "name" : "fmt::detail::buffer_traits",
   "referenced_type" : "_ZTIN3fmt3v106detail13buffer_traitsE",
   "self_type" : "_ZTIN3fmt3v106detail13buffer_traitsE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail13error_handlerE",
   "name" : "fmt::detail::error_handler",
   "referenced_type" : "_ZTIN3fmt3v106detail13error_handlerE",
   "self_type" : "_ZTIN3fmt3v106detail13error_handlerE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13has_format_asINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::has_format_as<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt3v106detail13has_format_asINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt3v106detail13has_format_asINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13has_format_asINS0_19basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEEEE",
   "name" : "fmt::detail::has_format_as<fmt::basic_memory_buffer<char, 500, std::allocator<char>>>",
   "referenced_type" : "_ZTIN3fmt3v106detail13has_format_asINS0_19basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEEEE",
   "self_type" : "_ZTIN3fmt3v106detail13has_format_asINS0_19basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1019basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13has_format_asINS0_9monostateEEE",
   "name" : "fmt::detail::has_format_as<fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt3v106detail13has_format_asINS0_9monostateEEE",
   "self_type" : "_ZTIN3fmt3v106detail13has_format_asINS0_9monostateEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v109monostateE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13has_format_asIPKcEE",
   "name" : "fmt::detail::has_format_as<const char *>",
   "referenced_type" : "_ZTIN3fmt3v106detail13has_format_asIPKcEE",
   "self_type" : "_ZTIN3fmt3v106detail13has_format_asIPKcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13has_format_asIiEE",
   "name" : "fmt::detail::has_format_as<int>",
   "referenced_type" : "_ZTIN3fmt3v106detail13has_format_asIiEE",
   "self_type" : "_ZTIN3fmt3v106detail13has_format_asIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13has_format_asIjEE",
   "name" : "fmt::detail::has_format_as<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v106detail13has_format_asIjEE",
   "self_type" : "_ZTIN3fmt3v106detail13has_format_asIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatINS0_17basic_string_viewIcEELb0EEE",
   "name" : "fmt::detail::is_fast_float<fmt::basic_string_view<char>, false>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatINS0_17basic_string_viewIcEELb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatINS0_17basic_string_viewIcEELb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatINS0_9monostateELb0EEE",
   "name" : "fmt::detail::is_fast_float<fmt::monostate, false>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatINS0_9monostateELb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatINS0_9monostateELb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v109monostateE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIPKcLb0EEE",
   "name" : "fmt::detail::is_fast_float<const char *>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIPKcLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIPKcLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIPKvLb0EEE",
   "name" : "fmt::detail::is_fast_float<const void *>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIPKvLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIPKvLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIbLb0EEE",
   "name" : "fmt::detail::is_fast_float<bool>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIbLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIbLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIcLb0EEE",
   "name" : "fmt::detail::is_fast_float<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIcLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIcLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIdLb1EEE",
   "name" : "fmt::detail::is_fast_float<double>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIdLb1EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIdLb1EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIeLb1EEE",
   "name" : "fmt::detail::is_fast_float<long double>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIeLb1EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIeLb1EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIfLb1EEE",
   "name" : "fmt::detail::is_fast_float<float>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIfLb1EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIfLb1EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIiLb0EEE",
   "name" : "fmt::detail::is_fast_float<int>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIiLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIiLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIjLb0EEE",
   "name" : "fmt::detail::is_fast_float<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIjLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIjLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatInLb0EEE",
   "name" : "fmt::detail::is_fast_float<__int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatInLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatInLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIoLb0EEE",
   "name" : "fmt::detail::is_fast_float<unsigned __int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIoLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIoLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIo"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIxLb0EEE",
   "name" : "fmt::detail::is_fast_float<long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIxLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIxLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13is_fast_floatIyLb0EEE",
   "name" : "fmt::detail::is_fast_float<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail13is_fast_floatIyLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail13is_fast_floatIyLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_13EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantINS0_17basic_string_viewIcEEcEE",
   "name" : "fmt::detail::type_constant<fmt::basic_string_view<char>, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantINS0_17basic_string_viewIcEEcEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantINS0_17basic_string_viewIcEEcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_15EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantINS0_9monostateEcEE",
   "name" : "fmt::detail::type_constant<fmt::monostate, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantINS0_9monostateEcEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantINS0_9monostateEcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v109monostateE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_15EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantINS1_13unformattableEcEE",
   "name" : "fmt::detail::type_constant<fmt::detail::unformattable, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantINS1_13unformattableEcEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantINS1_13unformattableEcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail13unformattableE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_12EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIPKccEE",
   "name" : "fmt::detail::type_constant<const char *, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIPKccEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIPKccEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_14EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIPKvcEE",
   "name" : "fmt::detail::type_constant<const void *, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIPKvcEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIPKvcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_7EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIbcEE",
   "name" : "fmt::detail::type_constant<bool, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIbcEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIbcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIccEE",
   "name" : "fmt::detail::type_constant<char, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIccEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIccEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_10EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIdcEE",
   "name" : "fmt::detail::type_constant<double, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIdcEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIdcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_11EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIecEE",
   "name" : "fmt::detail::type_constant<long double, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIecEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIecEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_9EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIfcEE",
   "name" : "fmt::detail::type_constant<float, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIfcEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIfcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIicEE",
   "name" : "fmt::detail::type_constant<int, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIicEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIicEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIjcEE",
   "name" : "fmt::detail::type_constant<unsigned int, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIjcEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIjcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_5EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIncEE",
   "name" : "fmt::detail::type_constant<__int128, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIncEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIncEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIn",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_6EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIocEE",
   "name" : "fmt::detail::type_constant<unsigned __int128, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIocEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIocEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIo",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_3EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIxcEE",
   "name" : "fmt::detail::type_constant<long long, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIxcEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIxcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantIycEE",
   "name" : "fmt::detail::type_constant<unsigned long long, char>",
   "referenced_type" : "_ZTIN3fmt3v106detail13type_constantIycEE",
   "self_type" : "_ZTIN3fmt3v106detail13type_constantIycEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail13unformattableE",
   "name" : "fmt::detail::unformattable",
   "referenced_type" : "_ZTIN3fmt3v106detail13unformattableE",
   "self_type" : "_ZTIN3fmt3v106detail13unformattableE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTIN3fmt3v1019basic_memory_bufferIwLm500ENSt3__19allocatorIwEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13utf8_to_utf16E",
   "name" : "fmt::detail::utf8_to_utf16",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail13utf8_to_utf16E",
   "self_type" : "_ZTIN3fmt3v106detail13utf8_to_utf16E",
   "size" : 2032,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "handler_",
     "referenced_type" : "_ZTIRN3fmt3v106detail13error_handlerE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13width_checkerINS1_13error_handlerEEE",
   "name" : "fmt::detail::width_checker<fmt::detail::error_handler>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail13width_checkerINS1_13error_handlerEEE",
   "self_type" : "_ZTIN3fmt3v106detail13width_checkerINS1_13error_handlerEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail13error_handlerE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "abs_value",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13write_int_argIjEE",
   "name" : "fmt::detail::write_int_arg<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v106detail13write_int_argIjEE",
   "self_type" : "_ZTIN3fmt3v106detail13write_int_argIjEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "abs_value",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13write_int_argImEE",
   "name" : "fmt::detail::write_int_arg<unsigned long>",
   "referenced_type" : "_ZTIN3fmt3v106detail13write_int_argImEE",
   "self_type" : "_ZTIN3fmt3v106detail13write_int_argImEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "abs_value",
     "referenced_type" : "_ZTIo"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13write_int_argIoEE",
   "name" : "fmt::detail::write_int_arg<unsigned __int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail13write_int_argIoEE",
   "self_type" : "_ZTIN3fmt3v106detail13write_int_argIoEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIo"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "significand_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail14big_decimal_fpE",
   "name" : "fmt::detail::big_decimal_fp",
   "referenced_type" : "_ZTIN3fmt3v106detail14big_decimal_fpE",
   "self_type" : "_ZTIN3fmt3v106detail14big_decimal_fpE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail14compile_stringE",
   "name" : "fmt::detail::compile_string",
   "referenced_type" : "_ZTIN3fmt3v106detail14compile_stringE",
   "self_type" : "_ZTIN3fmt3v106detail14compile_stringE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "group",
     "referenced_type" : "_ZTINSt3__111__wrap_iterIPKcEE"
    },
    {
     "field_name" : "pos",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail14digit_groupingIcE10next_stateE",
   "name" : "fmt::detail::digit_grouping<char>::next_state",
   "referenced_type" : "_ZTIN3fmt3v106detail14digit_groupingIcE10next_stateE",
   "self_type" : "_ZTIN3fmt3v106detail14digit_groupingIcE10next_stateE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "grouping_",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "thousands_sep_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail14digit_groupingIcEE",
   "name" : "fmt::detail::digit_grouping<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail14digit_groupingIcEE",
   "self_type" : "_ZTIN3fmt3v106detail14digit_groupingIcEE",
   "size" : 48,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail14named_arg_infoIcEE",
   "name" : "fmt::detail::named_arg_info<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail14named_arg_infoIcEE",
   "self_type" : "_ZTIN3fmt3v106detail14named_arg_infoIcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "padding",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail14write_int_dataIcEE",
   "name" : "fmt::detail::write_int_data<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail14write_int_dataIcEE",
   "self_type" : "_ZTIN3fmt3v106detail14write_int_dataIcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "access" : "private",
     "field_name" : "count_",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail15counting_bufferIcEE",
   "name" : "fmt::detail::counting_buffer<>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail15counting_bufferIcEE",
   "self_type" : "_ZTIN3fmt3v106detail15counting_bufferIcEE",
   "size" : 296,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v106detail15counting_bufferIcEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v106detail15counting_bufferIcE4growEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail13buffer_traitsE"
    },
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "out_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3fmt3v108appenderE"
    },
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail15iterator_bufferINS0_8appenderEcNS1_13buffer_traitsEEE",
   "name" : "fmt::detail::iterator_buffer<fmt::appender, char, fmt::detail::buffer_traits>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail15iterator_bufferINS0_8appenderEcNS1_13buffer_traitsEEE",
   "self_type" : "_ZTIN3fmt3v106detail15iterator_bufferINS0_8appenderEcNS1_13buffer_traitsEEE",
   "size" : 296,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v108appenderE",
    "_ZTIc",
    "_ZTIN3fmt3v106detail13buffer_traitsE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v106detail15iterator_bufferINS0_8appenderEcNS1_13buffer_traitsEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v106detail15iterator_bufferINS0_8appenderEcNS1_13buffer_traitsEE4growEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKN3fmt3v106detail14named_arg_infoIcEE"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail15named_arg_valueIcEE",
   "name" : "fmt::detail::named_arg_value<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail15named_arg_valueIcEE",
   "self_type" : "_ZTIN3fmt3v106detail15named_arg_valueIcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail15strip_named_argIA3_cLb0EEE",
   "name" : "fmt::detail::strip_named_arg<char[3]>",
   "referenced_type" : "_ZTIN3fmt3v106detail15strip_named_argIA3_cLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail15strip_named_argIA3_cLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail15strip_named_argIA7_cLb0EEE",
   "name" : "fmt::detail::strip_named_arg<char[7]>",
   "referenced_type" : "_ZTIN3fmt3v106detail15strip_named_argIA7_cLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail15strip_named_argIA7_cLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail15strip_named_argINS0_17basic_string_viewIcEELb0EEE",
   "name" : "fmt::detail::strip_named_arg<fmt::basic_string_view<char>, false>",
   "referenced_type" : "_ZTIN3fmt3v106detail15strip_named_argINS0_17basic_string_viewIcEELb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail15strip_named_argINS0_17basic_string_viewIcEELb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail15strip_named_argIiLb0EEE",
   "name" : "fmt::detail::strip_named_arg<int>",
   "referenced_type" : "_ZTIN3fmt3v106detail15strip_named_argIiLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail15strip_named_argIiLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail15strip_named_argIjLb0EEE",
   "name" : "fmt::detail::strip_named_arg<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v106detail15strip_named_argIjLb0EEE",
   "self_type" : "_ZTIN3fmt3v106detail15strip_named_argIjLb0EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "parse_ctx",
     "referenced_type" : "_ZTIRN3fmt3v1026basic_format_parse_contextIcEE"
    },
    {
     "field_name" : "ctx",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail16custom_formatterIcEE",
   "name" : "fmt::detail::custom_formatter<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail16custom_formatterIcEE",
   "self_type" : "_ZTIN3fmt3v106detail16custom_formatterIcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIA3_cEE",
   "name" : "fmt::detail::format_as_result<char[3]>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIA3_cEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIA3_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIA7_cEE",
   "name" : "fmt::detail::format_as_result<char[7]>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIA7_cEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIA7_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::format_as_result<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultINS0_19basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEEEE",
   "name" : "fmt::detail::format_as_result<fmt::basic_memory_buffer<char, 500, std::allocator<char>>>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultINS0_19basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEEEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultINS0_19basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1019basic_memory_bufferIcLm500ENSt3__19allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultINS0_9monostateEEE",
   "name" : "fmt::detail::format_as_result<fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultINS0_9monostateEEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultINS0_9monostateEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v109monostateE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIPKcEE",
   "name" : "fmt::detail::format_as_result<const char *>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIPKcEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIPKcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIPKvEE",
   "name" : "fmt::detail::format_as_result<const void *>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIPKvEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIPKvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIbEE",
   "name" : "fmt::detail::format_as_result<bool>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIbEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIbEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIcEE",
   "name" : "fmt::detail::format_as_result<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIcEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIdEE",
   "name" : "fmt::detail::format_as_result<double>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIdEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIeEE",
   "name" : "fmt::detail::format_as_result<long double>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIeEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIeEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIfEE",
   "name" : "fmt::detail::format_as_result<float>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIfEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIhEE",
   "name" : "fmt::detail::format_as_result<unsigned char>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIhEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIhEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIiEE",
   "name" : "fmt::detail::format_as_result<int>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIiEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIjEE",
   "name" : "fmt::detail::format_as_result<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIjEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultInEE",
   "name" : "fmt::detail::format_as_result<__int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultInEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultInEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIoEE",
   "name" : "fmt::detail::format_as_result<unsigned __int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIoEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIoEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIo"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIxEE",
   "name" : "fmt::detail::format_as_result<long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIxEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIxEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultIyEE",
   "name" : "fmt::detail::format_as_result<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail16format_as_resultIyEE",
   "self_type" : "_ZTIN3fmt3v106detail16format_as_resultIyEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "lo_",
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "hi_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail16uint128_fallbackE",
   "name" : "fmt::detail::uint128_fallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail16uint128_fallbackE",
   "self_type" : "_ZTIN3fmt3v106detail16uint128_fallbackE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail17counting_iterator10value_typeE",
   "name" : "fmt::detail::counting_iterator::value_type",
   "referenced_type" : "_ZTIN3fmt3v106detail17counting_iterator10value_typeE",
   "self_type" : "_ZTIN3fmt3v106detail17counting_iterator10value_typeE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "count_",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17counting_iteratorE",
   "name" : "fmt::detail::counting_iterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail17counting_iteratorE",
   "self_type" : "_ZTIN3fmt3v106detail17counting_iteratorE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEA3_cEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIA3_cEE",
   "name" : "fmt::detail::is_compile_string<char[3]>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIA3_cEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIA3_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEA7_cEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIA7_cEE",
   "name" : "fmt::detail::is_compile_string<char[7]>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIA7_cEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIA7_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringENS2_17basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::is_compile_string<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringENS2_9monostateEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringINS0_9monostateEEE",
   "name" : "fmt::detail::is_compile_string<fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringINS0_9monostateEEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringINS0_9monostateEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v109monostateE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEPKcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIPKcEE",
   "name" : "fmt::detail::is_compile_string<const char *>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIPKcEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIPKcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEPKvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIPKvEE",
   "name" : "fmt::detail::is_compile_string<const void *>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIPKvEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIPKvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEbEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIbEE",
   "name" : "fmt::detail::is_compile_string<bool>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIbEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIbEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIcEE",
   "name" : "fmt::detail::is_compile_string<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIcEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEdEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIdEE",
   "name" : "fmt::detail::is_compile_string<double>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIdEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEeEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIeEE",
   "name" : "fmt::detail::is_compile_string<long double>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIeEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIeEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEfEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIfEE",
   "name" : "fmt::detail::is_compile_string<float>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIfEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEhEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIhEE",
   "name" : "fmt::detail::is_compile_string<unsigned char>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIhEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIhEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEiEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIiEE",
   "name" : "fmt::detail::is_compile_string<int>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIiEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEjEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIjEE",
   "name" : "fmt::detail::is_compile_string<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIjEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEnEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringInEE",
   "name" : "fmt::detail::is_compile_string<__int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringInEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringInEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEoEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIoEE",
   "name" : "fmt::detail::is_compile_string<unsigned __int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIoEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIoEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIo"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringExEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIxEE",
   "name" : "fmt::detail::is_compile_string<long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIxEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIxEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt3v106detail14compile_stringEyEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17is_compile_stringIyEE",
   "name" : "fmt::detail::is_compile_string<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail17is_compile_stringIyEE",
   "self_type" : "_ZTIN3fmt3v106detail17is_compile_stringIyEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "handler_",
     "referenced_type" : "_ZTIRN3fmt3v106detail13error_handlerE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17precision_checkerINS1_13error_handlerEEE",
   "name" : "fmt::detail::precision_checker<fmt::detail::error_handler>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail17precision_checkerINS1_13error_handlerEEE",
   "self_type" : "_ZTIN3fmt3v106detail17precision_checkerINS1_13error_handlerEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail13error_handlerE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "begin",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "end",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "cp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail18find_escape_resultIcEE",
   "name" : "fmt::detail::find_escape_result<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail18find_escape_resultIcEE",
   "self_type" : "_ZTIN3fmt3v106detail18find_escape_resultIcEE",
   "size" : 24,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail18is_output_iteratorINS0_8appenderEcvEE",
   "name" : "fmt::detail::is_output_iterator<fmt::appender, char, void>",
   "referenced_type" : "_ZTIN3fmt3v106detail18is_output_iteratorINS0_8appenderEcvEE",
   "self_type" : "_ZTIN3fmt3v106detail18is_output_iteratorINS0_8appenderEcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v108appenderE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail13unformattableE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail18unformattable_charE",
   "name" : "fmt::detail::unformattable_char",
   "referenced_type" : "_ZTIN3fmt3v106detail18unformattable_charE",
   "self_type" : "_ZTIN3fmt3v106detail18unformattable_charE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "count_",
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "limit_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail19fixed_buffer_traitsE",
   "name" : "fmt::detail::fixed_buffer_traits",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail19fixed_buffer_traitsE",
   "self_type" : "_ZTIN3fmt3v106detail19fixed_buffer_traitsE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v1012format_specsIcEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "width_ref",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt3v106detail7arg_refIcEE"
    },
    {
     "field_name" : "precision_ref",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN3fmt3v106detail7arg_refIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail20dynamic_format_specsIcEE",
   "name" : "fmt::detail::dynamic_format_specs<>",
   "referenced_type" : "_ZTIN3fmt3v106detail20dynamic_format_specsIcEE",
   "self_type" : "_ZTIN3fmt3v106detail20dynamic_format_specsIcEE",
   "size" : 64,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "grouping",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 192,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail20thousands_sep_resultIcEE",
   "name" : "fmt::detail::thousands_sep_result<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail20thousands_sep_resultIcEE",
   "self_type" : "_ZTIN3fmt3v106detail20thousands_sep_resultIcEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "grouping",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 192,
     "referenced_type" : "_ZTIw"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail20thousands_sep_resultIwEE",
   "name" : "fmt::detail::thousands_sep_result<wchar_t>",
   "referenced_type" : "_ZTIN3fmt3v106detail20thousands_sep_resultIwEE",
   "self_type" : "_ZTIN3fmt3v106detail20thousands_sep_resultIwEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v1026basic_format_parse_contextIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "num_args_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "types_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKN3fmt3v106detail4typeE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21compile_parse_contextIcEE",
   "name" : "fmt::detail::compile_parse_context<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail21compile_parse_contextIcEE",
   "self_type" : "_ZTIN3fmt3v106detail21compile_parse_contextIcEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "out",
     "referenced_type" : "_ZTIN3fmt3v108appenderE"
    },
    {
     "field_name" : "args",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEE"
    },
    {
     "field_name" : "loc",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN3fmt3v106detail10locale_refE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21default_arg_formatterIcEE",
   "name" : "fmt::detail::default_arg_formatter<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail21default_arg_formatterIcEE",
   "self_type" : "_ZTIN3fmt3v106detail21default_arg_formatterIcEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "begin",
     "referenced_type" : "_ZTIN3fmt3v108appenderE"
    },
    {
     "field_name" : "end",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v108appenderE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21format_decimal_resultINS0_8appenderEEE",
   "name" : "fmt::detail::format_decimal_result<fmt::appender>",
   "referenced_type" : "_ZTIN3fmt3v106detail21format_decimal_resultINS0_8appenderEEE",
   "self_type" : "_ZTIN3fmt3v106detail21format_decimal_resultINS0_8appenderEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v108appenderE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "begin",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "end",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21format_decimal_resultIPcEE",
   "name" : "fmt::detail::format_decimal_result<char *>",
   "referenced_type" : "_ZTIN3fmt3v106detail21format_decimal_resultIPcEE",
   "self_type" : "_ZTIN3fmt3v106detail21format_decimal_resultIPcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "types_",
     "referenced_type" : "_ZTIA2_N3fmt3v106detail4typeE"
    },
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v106detail21compile_parse_contextIcEE"
    },
    {
     "access" : "private",
     "field_name" : "parse_funcs_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA2_PFPKcRN3fmt3v106detail21compile_parse_contextIcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21format_string_checkerIcJA7_ciEEE",
   "name" : "fmt::detail::format_string_checker<char, char[7], int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail21format_string_checkerIcJA7_ciEEE",
   "self_type" : "_ZTIN3fmt3v106detail21format_string_checkerIcJA7_ciEEE",
   "size" : 56,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "types_",
     "referenced_type" : "_ZTIA1_N3fmt3v106detail4typeE"
    },
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v106detail21compile_parse_contextIcEE"
    },
    {
     "access" : "private",
     "field_name" : "parse_funcs_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA1_PFPKcRN3fmt3v106detail21compile_parse_contextIcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21format_string_checkerIcJEEE",
   "name" : "fmt::detail::format_string_checker<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail21format_string_checkerIcJEEE",
   "self_type" : "_ZTIN3fmt3v106detail21format_string_checkerIcJEEE",
   "size" : 48,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "types_",
     "referenced_type" : "_ZTIA2_N3fmt3v106detail4typeE"
    },
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v106detail21compile_parse_contextIcEE"
    },
    {
     "access" : "private",
     "field_name" : "parse_funcs_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA2_PFPKcRN3fmt3v106detail21compile_parse_contextIcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21format_string_checkerIcJNS0_17basic_string_viewIcEEA3_cEEE",
   "name" : "fmt::detail::format_string_checker<char, basic_string_view<char>, char[3]>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail21format_string_checkerIcJNS0_17basic_string_viewIcEEA3_cEEE",
   "self_type" : "_ZTIN3fmt3v106detail21format_string_checkerIcJNS0_17basic_string_viewIcEEA3_cEEE",
   "size" : 56,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "types_",
     "referenced_type" : "_ZTIA1_N3fmt3v106detail4typeE"
    },
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v106detail21compile_parse_contextIcEE"
    },
    {
     "access" : "private",
     "field_name" : "parse_funcs_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA1_PFPKcRN3fmt3v106detail21compile_parse_contextIcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21format_string_checkerIcJiEEE",
   "name" : "fmt::detail::format_string_checker<char, int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail21format_string_checkerIcJiEEE",
   "self_type" : "_ZTIN3fmt3v106detail21format_string_checkerIcJiEEE",
   "size" : 48,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "types_",
     "referenced_type" : "_ZTIA1_N3fmt3v106detail4typeE"
    },
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v106detail21compile_parse_contextIcEE"
    },
    {
     "access" : "private",
     "field_name" : "parse_funcs_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA1_PFPKcRN3fmt3v106detail21compile_parse_contextIcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21format_string_checkerIcJjEEE",
   "name" : "fmt::detail::format_string_checker<char, unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail21format_string_checkerIcJjEEE",
   "self_type" : "_ZTIN3fmt3v106detail21format_string_checkerIcJjEEE",
   "size" : 48,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail13unformattableE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21unformattable_pointerE",
   "name" : "fmt::detail::unformattable_pointer",
   "referenced_type" : "_ZTIN3fmt3v106detail21unformattable_pointerE",
   "self_type" : "_ZTIN3fmt3v106detail21unformattable_pointerE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ctx",
     "referenced_type" : "_ZTIRN3fmt3v1026basic_format_parse_contextIcEE"
    },
    {
     "field_name" : "ref",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRN3fmt3v106detail7arg_refIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail23dynamic_spec_id_handlerIcEE",
   "name" : "fmt::detail::dynamic_spec_id_handler<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail23dynamic_spec_id_handlerIcEE",
   "self_type" : "_ZTIN3fmt3v106detail23dynamic_spec_id_handlerIcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail23fallback_digit_groupingIcEE",
   "name" : "fmt::detail::fallback_digit_grouping<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail23fallback_digit_groupingIcEE",
   "self_type" : "_ZTIN3fmt3v106detail23fallback_digit_groupingIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail23is_back_insert_iteratorINS0_8appenderEEE",
   "name" : "fmt::detail::is_back_insert_iterator<fmt::appender>",
   "referenced_type" : "_ZTIN3fmt3v106detail23is_back_insert_iteratorINS0_8appenderEEE",
   "self_type" : "_ZTIN3fmt3v106detail23is_back_insert_iteratorINS0_8appenderEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v108appenderE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail23is_statically_named_argIRA3_KcEE",
   "name" : "fmt::detail::is_statically_named_arg<const char (&)[3]>",
   "referenced_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIRA3_KcEE",
   "self_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIRA3_KcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRA3_Kc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail23is_statically_named_argIRA7_KcEE",
   "name" : "fmt::detail::is_statically_named_arg<const char (&)[7]>",
   "referenced_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIRA7_KcEE",
   "self_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIRA7_KcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRA7_Kc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail23is_statically_named_argIRNS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::is_statically_named_arg<fmt::basic_string_view<char> &>",
   "referenced_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIRNS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIRNS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail23is_statically_named_argIRiEE",
   "name" : "fmt::detail::is_statically_named_arg<int &>",
   "referenced_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIRiEE",
   "self_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIRiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail23is_statically_named_argIRjEE",
   "name" : "fmt::detail::is_statically_named_arg<unsigned int &>",
   "referenced_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIRjEE",
   "self_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIRjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIRj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail23is_statically_named_argIiEE",
   "name" : "fmt::detail::is_statically_named_arg<int>",
   "referenced_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIiEE",
   "self_type" : "_ZTIN3fmt3v106detail23is_statically_named_argIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail4viewE",
   "name" : "fmt::detail::view",
   "referenced_type" : "_ZTIN3fmt3v106detail4viewE",
   "self_type" : "_ZTIN3fmt3v106detail4viewE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "name" : "fmt::detail::value<fmt::basic_format_context<fmt::appender, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "self_type" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "no_value",
     "referenced_type" : "_ZTIN3fmt3v109monostateE"
    },
    {
     "field_name" : "int_value",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uint_value",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "long_long_value",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "ulong_long_value",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "int128_value",
     "referenced_type" : "_ZTIn"
    },
    {
     "field_name" : "uint128_value",
     "referenced_type" : "_ZTIo"
    },
    {
     "field_name" : "bool_value",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "char_value",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "float_value",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "double_value",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "long_double_value",
     "referenced_type" : "_ZTIe"
    },
    {
     "field_name" : "pointer",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "string",
     "referenced_type" : "_ZTIN3fmt3v106detail12string_valueIcEE"
    },
    {
     "field_name" : "custom",
     "referenced_type" : "_ZTIN3fmt3v106detail12custom_valueINS0_20basic_format_contextINS0_8appenderEcEEEE"
    },
    {
     "field_name" : "named_args",
     "referenced_type" : "_ZTIN3fmt3v106detail15named_arg_valueIcEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEUt_E",
   "name" : "fmt::detail::value<fmt::basic_format_context<fmt::appender, char>>::(anonymous)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEUt_E",
   "self_type" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEUt_E",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "bigits_",
     "referenced_type" : "_ZTIN3fmt3v1019basic_memory_bufferIjLm32ENSt3__19allocatorIjEEEE"
    },
    {
     "access" : "private",
     "field_name" : "exp_",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6bigintE",
   "name" : "fmt::detail::bigint",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail6bigintE",
   "self_type" : "_ZTIN3fmt3v106detail6bigintE",
   "size" : 168,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6bufferIcEE",
   "name" : "fmt::detail::buffer<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail6bufferIcEE",
   "self_type" : "_ZTIN3fmt3v106detail6bufferIcEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v106detail6bufferIcEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3fmt3v106detail6bufferIcE4growEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPi"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6bufferIiEE",
   "name" : "fmt::detail::buffer<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail6bufferIiEE",
   "self_type" : "_ZTIN3fmt3v106detail6bufferIiEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v106detail6bufferIiEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3fmt3v106detail6bufferIiE4growEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPj"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6bufferIjEE",
   "name" : "fmt::detail::buffer<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail6bufferIjEE",
   "self_type" : "_ZTIN3fmt3v106detail6bufferIjEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v106detail6bufferIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3fmt3v106detail6bufferIjE4growEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPw"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6bufferIwEE",
   "name" : "fmt::detail::buffer<wchar_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v106detail6bufferIwEE",
   "self_type" : "_ZTIN3fmt3v106detail6bufferIwEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIw"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v106detail6bufferIwEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3fmt3v106detail6bufferIwE4growEm"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6fill_tIcEE",
   "name" : "fmt::detail::fill_t<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail6fill_tIcEE",
   "self_type" : "_ZTIN3fmt3v106detail6fill_tIcEE",
   "size" : 5,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail7arg_refIcE5valueE",
   "name" : "fmt::detail::arg_ref<char>::value",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN3fmt3v106detail7arg_refIcE5valueE",
   "self_type" : "_ZTIN3fmt3v106detail7arg_refIcE5valueE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "kind",
     "referenced_type" : "_ZTIN3fmt3v106detail11arg_id_kindE"
    },
    {
     "field_name" : "val",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v106detail7arg_refIcE5valueE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail7arg_refIcEE",
   "name" : "fmt::detail::arg_ref<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail7arg_refIcEE",
   "self_type" : "_ZTIN3fmt3v106detail7arg_refIcEE",
   "size" : 24,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "str",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail7udl_argIcEE",
   "name" : "fmt::detail::udl_arg<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail7udl_argIcEE",
   "self_type" : "_ZTIN3fmt3v106detail7udl_argIcEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIA1_N3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm0ELm0EEE",
   "name" : "fmt::detail::arg_data<fmt::detail::value<fmt::basic_format_context<fmt::appender, char>>, char, 0, 0>",
   "referenced_type" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm0ELm0EEE",
   "self_type" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm0ELm0EEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIA1_N3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm1ELm0EEE",
   "name" : "fmt::detail::arg_data<fmt::detail::value<fmt::basic_format_context<fmt::appender, char>>, char, 1, 0>",
   "referenced_type" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm1ELm0EEE",
   "self_type" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm1ELm0EEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIA2_N3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm2ELm0EEE",
   "name" : "fmt::detail::arg_data<fmt::detail::value<fmt::basic_format_context<fmt::appender, char>>, char, 2, 0>",
   "referenced_type" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm2ELm0EEE",
   "self_type" : "_ZTIN3fmt3v106detail8arg_dataINS1_5valueINS0_20basic_format_contextINS0_8appenderEcEEEEcLm2ELm0EEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "e",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail8basic_fpImEE",
   "name" : "fmt::detail::basic_fp<unsigned long>",
   "referenced_type" : "_ZTIN3fmt3v106detail8basic_fpImEE",
   "self_type" : "_ZTIN3fmt3v106detail8basic_fpImEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIo"
    },
    {
     "field_name" : "e",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail8basic_fpIoEE",
   "name" : "fmt::detail::basic_fp<unsigned __int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail8basic_fpIoEE",
   "self_type" : "_ZTIN3fmt3v106detail8basic_fpIoEE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIo"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "e",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail8basic_fpIyEE",
   "name" : "fmt::detail::basic_fp<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail8basic_fpIyEE",
   "self_type" : "_ZTIN3fmt3v106detail8basic_fpIyEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox10decimal_fpIdEE",
   "name" : "fmt::detail::dragonbox::decimal_fp<double>",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox10decimal_fpIdEE",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox10decimal_fpIdEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox10decimal_fpIfEE",
   "name" : "fmt::detail::dragonbox::decimal_fp<float>",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox10decimal_fpIfEE",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox10decimal_fpIfEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox10float_infoIdvEE",
   "name" : "fmt::detail::dragonbox::float_info<double>",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox10float_infoIdvEE",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox10float_infoIdvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox10float_infoIevEE",
   "name" : "fmt::detail::dragonbox::float_info<long double>",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox10float_infoIevEE",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox10float_infoIevEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIe",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox10float_infoIfvEE",
   "name" : "fmt::detail::dragonbox::float_info<float>",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox10float_infoIfvEE",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox10float_infoIfvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIf",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "result",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "is_integer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIdE18compute_mul_resultE",
   "name" : "fmt::detail::dragonbox::cache_accessor<double>::compute_mul_result",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIdE18compute_mul_resultE",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIdE18compute_mul_resultE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "parity",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "is_integer",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIdE25compute_mul_parity_resultE",
   "name" : "fmt::detail::dragonbox::cache_accessor<double>::compute_mul_parity_result",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIdE25compute_mul_parity_resultE",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIdE25compute_mul_parity_resultE",
   "size" : 2,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIdEE",
   "name" : "fmt::detail::dragonbox::cache_accessor<double>",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIdEE",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "result",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "is_integer",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIfE18compute_mul_resultE",
   "name" : "fmt::detail::dragonbox::cache_accessor<float>::compute_mul_result",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIfE18compute_mul_resultE",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIfE18compute_mul_resultE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "parity",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "is_integer",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIfE25compute_mul_parity_resultE",
   "name" : "fmt::detail::dragonbox::cache_accessor<float>::compute_mul_parity_result",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIfE25compute_mul_parity_resultE",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIfE25compute_mul_parity_resultE",
   "size" : 2,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIfEE",
   "name" : "fmt::detail::dragonbox::cache_accessor<float>",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIfEE",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox14cache_accessorIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "divisor",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shift_amount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox3$_7E",
   "name" : "fmt::detail::dragonbox::(unnamed)",
   "referenced_type" : "_ZTIN3fmt3v106detail9dragonbox3$_7E",
   "self_type" : "_ZTIN3fmt3v106detail9dragonbox3$_7E",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_localeIZZNKS0_9formatterINS1_6bigintEcvE6formatERKS4_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE0_clEvE18FMT_COMPILE_STRINGvEE",
   "name" : "fmt::detail::is_locale<FMT_COMPILE_STRING>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_localeIZZNKS0_9formatterINS1_6bigintEcvE6formatERKS4_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE0_clEvE18FMT_COMPILE_STRINGvEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_localeIZZNKS0_9formatterINS1_6bigintEcvE6formatERKS4_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE0_clEvE18FMT_COMPILE_STRINGvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE0_clEvE18FMT_COMPILE_STRING",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_localeIZZNKS0_9formatterINS1_6bigintEcvE6formatERKS4_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE1_clEvE18FMT_COMPILE_STRINGvEE",
   "name" : "fmt::detail::is_locale<FMT_COMPILE_STRING>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_localeIZZNKS0_9formatterINS1_6bigintEcvE6formatERKS4_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE1_clEvE18FMT_COMPILE_STRINGvEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_localeIZZNKS0_9formatterINS1_6bigintEcvE6formatERKS4_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE1_clEvE18FMT_COMPILE_STRINGvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE1_clEvE18FMT_COMPILE_STRING",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_localeIZZNKS0_9formatterINS1_6bigintEcvE6formatERKS4_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE_clEvE18FMT_COMPILE_STRINGvEE",
   "name" : "fmt::detail::is_locale<FMT_COMPILE_STRING>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_localeIZZNKS0_9formatterINS1_6bigintEcvE6formatERKS4_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE_clEvE18FMT_COMPILE_STRINGvEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_localeIZZNKS0_9formatterINS1_6bigintEcvE6formatERKS4_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE_clEvE18FMT_COMPILE_STRINGvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE_clEvE18FMT_COMPILE_STRING",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIN3fmt3v1017basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIA3_cEE",
   "name" : "fmt::detail::is_string<char[3]>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIA3_cEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIA3_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIN3fmt3v1017basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIA7_cEE",
   "name" : "fmt::detail::is_string<char[7]>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIA7_cEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIA7_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIN3fmt3v1017basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::is_string<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringINS0_9monostateEEE",
   "name" : "fmt::detail::is_string<fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringINS0_9monostateEEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringINS0_9monostateEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v109monostateE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIN3fmt3v1017basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIPKcEE",
   "name" : "fmt::detail::is_string<const char *>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIPKcEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIPKcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIPKvEE",
   "name" : "fmt::detail::is_string<const void *>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIPKvEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIPKvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIbEE",
   "name" : "fmt::detail::is_string<bool>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIbEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIbEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIcEE",
   "name" : "fmt::detail::is_string<char>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIcEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIdEE",
   "name" : "fmt::detail::is_string<double>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIdEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIeEE",
   "name" : "fmt::detail::is_string<long double>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIeEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIeEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIfEE",
   "name" : "fmt::detail::is_string<float>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIfEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIhEE",
   "name" : "fmt::detail::is_string<unsigned char>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIhEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIhEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIiEE",
   "name" : "fmt::detail::is_string<int>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIiEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIjEE",
   "name" : "fmt::detail::is_string<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIjEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringInEE",
   "name" : "fmt::detail::is_string<__int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringInEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringInEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIoEE",
   "name" : "fmt::detail::is_string<unsigned __int128>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIoEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIoEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIo"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIxEE",
   "name" : "fmt::detail::is_string<long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIxEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIxEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9is_stringIyEE",
   "name" : "fmt::detail::is_string<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt3v106detail9is_stringIyEE",
   "self_type" : "_ZTIN3fmt3v106detail9is_stringIyEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "upper",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "lower_count",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9singletonE",
   "name" : "fmt::detail::singleton",
   "referenced_type" : "_ZTIN3fmt3v106detail9singletonE",
   "self_type" : "_ZTIN3fmt3v106detail9singletonE",
   "size" : 2,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIA3_cEE",
   "name" : "fmt::is_char<char[3]>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIA3_cEE",
   "self_type" : "_ZTIN3fmt3v107is_charIA3_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIA7_cEE",
   "name" : "fmt::is_char<char[7]>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIA7_cEE",
   "self_type" : "_ZTIN3fmt3v107is_charIA7_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::is_char<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt3v107is_charINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt3v107is_charINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charINS0_9monostateEEE",
   "name" : "fmt::is_char<fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt3v107is_charINS0_9monostateEEE",
   "self_type" : "_ZTIN3fmt3v107is_charINS0_9monostateEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v109monostateE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIPKcEE",
   "name" : "fmt::is_char<const char *>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIPKcEE",
   "self_type" : "_ZTIN3fmt3v107is_charIPKcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIPKvEE",
   "name" : "fmt::is_char<const void *>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIPKvEE",
   "self_type" : "_ZTIN3fmt3v107is_charIPKvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIPcEE",
   "name" : "fmt::is_char<char *>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIPcEE",
   "self_type" : "_ZTIN3fmt3v107is_charIPcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIbEE",
   "name" : "fmt::is_char<bool>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIbEE",
   "self_type" : "_ZTIN3fmt3v107is_charIbEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIcEE",
   "name" : "fmt::is_char<char>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIcEE",
   "self_type" : "_ZTIN3fmt3v107is_charIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIdEE",
   "name" : "fmt::is_char<double>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIdEE",
   "self_type" : "_ZTIN3fmt3v107is_charIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIeEE",
   "name" : "fmt::is_char<long double>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIeEE",
   "self_type" : "_ZTIN3fmt3v107is_charIeEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIfEE",
   "name" : "fmt::is_char<float>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIfEE",
   "self_type" : "_ZTIN3fmt3v107is_charIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIhEE",
   "name" : "fmt::is_char<unsigned char>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIhEE",
   "self_type" : "_ZTIN3fmt3v107is_charIhEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIiEE",
   "name" : "fmt::is_char<int>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIiEE",
   "self_type" : "_ZTIN3fmt3v107is_charIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIjEE",
   "name" : "fmt::is_char<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIjEE",
   "self_type" : "_ZTIN3fmt3v107is_charIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charInEE",
   "name" : "fmt::is_char<__int128>",
   "referenced_type" : "_ZTIN3fmt3v107is_charInEE",
   "self_type" : "_ZTIN3fmt3v107is_charInEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIoEE",
   "name" : "fmt::is_char<unsigned __int128>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIoEE",
   "self_type" : "_ZTIN3fmt3v107is_charIoEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIo"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIvEE",
   "name" : "fmt::is_char<void>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIvEE",
   "self_type" : "_ZTIN3fmt3v107is_charIvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIxEE",
   "name" : "fmt::is_char<long long>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIxEE",
   "self_type" : "_ZTIN3fmt3v107is_charIxEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIyEE",
   "name" : "fmt::is_char<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt3v107is_charIyEE",
   "self_type" : "_ZTIN3fmt3v107is_charIyEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt3v106detail6bufferIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v108appenderE",
   "name" : "fmt::appender",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v108appenderE",
   "self_type" : "_ZTIN3fmt3v108appenderE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt3v106detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v109formatterINS0_17basic_string_viewIcEEcvEE",
   "name" : "fmt::formatter<fmt::basic_string_view<char>, char, void>",
   "referenced_type" : "_ZTIN3fmt3v109formatterINS0_17basic_string_viewIcEEcvEE",
   "self_type" : "_ZTIN3fmt3v109formatterINS0_17basic_string_viewIcEEcvEE",
   "size" : 64,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt3v106detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v109formatterINS0_5bytesEcvEE",
   "name" : "fmt::formatter<fmt::bytes, char, void>",
   "referenced_type" : "_ZTIN3fmt3v109formatterINS0_5bytesEcvEE",
   "self_type" : "_ZTIN3fmt3v109formatterINS0_5bytesEcvEE",
   "size" : 64,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v105bytesE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v109formatterINS0_6detail6bigintEcvEE",
   "name" : "fmt::formatter<fmt::detail::bigint, char, void>",
   "referenced_type" : "_ZTIN3fmt3v109formatterINS0_6detail6bigintEcvEE",
   "self_type" : "_ZTIN3fmt3v109formatterINS0_6detail6bigintEcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail6bigintE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v109formatterINS0_9monostateEcvEE",
   "name" : "fmt::formatter<fmt::monostate, char, void>",
   "referenced_type" : "_ZTIN3fmt3v109formatterINS0_9monostateEcvEE",
   "self_type" : "_ZTIN3fmt3v109formatterINS0_9monostateEcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v109monostateE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt3v106detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v109formatterIPKccvEE",
   "name" : "fmt::formatter<const char *>",
   "referenced_type" : "_ZTIN3fmt3v109formatterIPKccvEE",
   "self_type" : "_ZTIN3fmt3v109formatterIPKccvEE",
   "size" : 64,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt3v106detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v109formatterIicvEE",
   "name" : "fmt::formatter<int>",
   "referenced_type" : "_ZTIN3fmt3v109formatterIicvEE",
   "self_type" : "_ZTIN3fmt3v109formatterIicvEE",
   "size" : 64,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt3v106detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v109formatterIjcvEE",
   "name" : "fmt::formatter<unsigned int>",
   "referenced_type" : "_ZTIN3fmt3v109formatterIjcvEE",
   "self_type" : "_ZTIN3fmt3v109formatterIjcvEE",
   "size" : 64,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value_",
     "referenced_type" : "_ZTIN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v109loc_valueE",
   "name" : "fmt::loc_value",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt3v109loc_valueE",
   "self_type" : "_ZTIN3fmt3v109loc_valueE",
   "size" : 32,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v109monostateE",
   "name" : "fmt::monostate",
   "referenced_type" : "_ZTIN3fmt3v109monostateE",
   "self_type" : "_ZTIN3fmt3v109monostateE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogMessageE",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogMessageE",
   "self_type" : "_ZTIN7android4base10LogMessageE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "_ZTIN7android4base5LogIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogdLoggerE",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogdLoggerE",
   "self_type" : "_ZTIN7android4base10LogdLoggerE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "base_",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "offset_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10MappedFileE",
   "name" : "android::base::MappedFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10MappedFileE",
   "self_type" : "_ZTIN7android4base10MappedFileE",
   "size" : 24,
   "source_file" : "system/libbase/include/android-base/mapped_file.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10boot_clockE",
   "name" : "android::base::boot_clock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10boot_clockE",
   "self_type" : "_ZTIN7android4base10boot_clockE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/chrono_utils.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIiiEE",
   "name" : "android::base::log_detail::StorageTypes<int, int>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIiiEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIiiEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIilEE",
   "name" : "android::base::log_detail::StorageTypes<int, long>",
   "referenced_type" : "_ZTIN7android4base10log_detail12StorageTypesIilEE",
   "self_type" : "_ZTIN7android4base10log_detail12StorageTypesIilEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIiEE",
   "name" : "android::base::log_detail::IsCharPointer<int>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIiEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIiEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIlEE",
   "name" : "android::base::log_detail::IsCharPointer<long>",
   "referenced_type" : "_ZTIN7android4base10log_detail13IsCharPointerIlEE",
   "self_type" : "_ZTIN7android4base10log_detail13IsCharPointerIlEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIiEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIiiEE",
   "name" : "android::base::log_detail::EagerEvaluator<int, int>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIiiEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIiiEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIiEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIlEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIilEE",
   "name" : "android::base::log_detail::EagerEvaluator<int, long>",
   "referenced_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIilEE",
   "self_type" : "_ZTIN7android4base10log_detail14EagerEvaluatorIilEE",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIiEE",
   "name" : "android::base::log_detail::Storage<int>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIiEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIiEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIlEE",
   "name" : "android::base::log_detail::Storage<long>",
   "referenced_type" : "_ZTIN7android4base10log_detail7StorageIlEE",
   "self_type" : "_ZTIN7android4base10log_detail7StorageIlEE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base11borrowed_fdE",
   "name" : "android::base::borrowed_fd",
   "referenced_type" : "_ZTIN7android4base11borrowed_fdE",
   "self_type" : "_ZTIN7android4base11borrowed_fdE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "name" : "android::base::LogNullGuard<std::nullptr_t>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIDn"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "name" : "android::base::LogNullGuard<const char *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "name" : "android::base::LogNullGuard<char *>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIiEE",
   "name" : "android::base::LogNullGuard<int>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIiEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIiEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIlEE",
   "name" : "android::base::LogNullGuard<long>",
   "referenced_type" : "_ZTIN7android4base12LogNullGuardIlEE",
   "self_type" : "_ZTIN7android4base12LogNullGuardIlEE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base13DefaultCloserE",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "_ZTIN7android4base13DefaultCloserE",
   "self_type" : "_ZTIN7android4base13DefaultCloserE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "_ZTIKi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base13ErrnoRestorerE",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base13ErrnoRestorerE",
   "self_type" : "_ZTIN7android4base13ErrnoRestorerE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/errno_restorer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "property_name_",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "prop_info_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK9prop_info"
    },
    {
     "access" : "private",
     "field_name" : "cached_area_serial_",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__18optionalIjEE"
    },
    {
     "access" : "private",
     "field_name" : "cached_property_serial_",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__18optionalIjEE"
    },
    {
     "access" : "private",
     "field_name" : "cached_value_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA92_c"
    },
    {
     "access" : "private",
     "field_name" : "is_read_only_",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "read_only_property_",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14CachedPropertyE",
   "name" : "android::base::CachedProperty",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base14CachedPropertyE",
   "self_type" : "_ZTIN7android4base14CachedPropertyE",
   "size" : 152,
   "source_file" : "system/libbase/include/android-base/properties.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h",
   "template_args" :
   [
    "_ZTIN7android4base13DefaultCloserE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "_ZTIN7android4base11LogSeverityE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base17ScopedLogSeverityE",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base17ScopedLogSeverityE",
   "self_type" : "_ZTIN7android4base17ScopedLogSeverityE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "cached_parsed_property_",
     "referenced_type" : "_ZTIN7android4base20CachedParsedPropertyIPFNSt3__18optionalIbEEPKcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base18CachedBoolPropertyE",
   "name" : "android::base::CachedBoolProperty",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base18CachedBoolPropertyE",
   "self_type" : "_ZTIN7android4base18CachedBoolPropertyE",
   "size" : 208,
   "source_file" : "system/libbase/include/android-base/properties.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mutex_",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "cached_property_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android4base14CachedPropertyE"
    },
    {
     "access" : "private",
     "field_name" : "cached_result_",
     "field_offset" : 1536,
     "referenced_type" : "_ZTINSt3__18optionalINS0_IbEEEE"
    },
    {
     "access" : "private",
     "field_name" : "parser_",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPFNSt3__18optionalIbEEPKcE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base20CachedParsedPropertyIPFNSt3__18optionalIbEEPKcEEE",
   "name" : "android::base::CachedParsedProperty<optional<bool> (*)(const char *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base20CachedParsedPropertyIPFNSt3__18optionalIbEEPKcEEE",
   "self_type" : "_ZTIN7android4base20CachedParsedPropertyIPFNSt3__18optionalIbEEPKcEEE",
   "size" : 208,
   "source_file" : "system/libbase/include/android-base/properties.h",
   "template_args" :
   [
    "_ZTIPFNSt3__18optionalIbEEPKcE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "start_",
     "referenced_type" : "_ZTINSt3__16chrono10time_pointIN7android4base10boot_clockENS0_8durationIxNS_5ratioILl1ELl1000000000EEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base5TimerE",
   "name" : "android::base::Timer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base5TimerE",
   "self_type" : "_ZTIN7android4base5TimerE",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/chrono_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pid_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "dir_",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__110unique_ptrI3DIRPFiPS1_EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base7AllPids11PidIteratorE",
   "name" : "android::base::AllPids::PidIterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base7AllPids11PidIteratorE",
   "self_type" : "_ZTIN7android4base7AllPids11PidIteratorE",
   "size" : 24,
   "source_file" : "system/libbase/include/android-base/process.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base7AllPidsE",
   "name" : "android::base::AllPids",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base7AllPidsE",
   "self_type" : "_ZTIN7android4base7AllPidsE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/process.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail13error_handlerE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "parse_context",
     "referenced_type" : "_ZTIN3fmt3v1026basic_format_parse_contextIcEE"
    },
    {
     "field_name" : "context",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail10vformat_toIcEEvRNS1_6bufferIT_EENS0_17basic_string_viewIS4_EENS1_12vformat_argsIS4_E4typeENS1_10locale_refEE14format_handler",
   "name" : "format_handler",
   "referenced_type" : "_ZTIZN3fmt3v106detail10vformat_toIcEEvRNS1_6bufferIT_EENS0_17basic_string_viewIS4_EENS1_12vformat_argsIS4_E4typeENS1_10locale_refEE14format_handler",
   "self_type" : "_ZTIZN3fmt3v106detail10vformat_toIcEEvRNS1_6bufferIT_EENS0_17basic_string_viewIS4_EENS1_12vformat_argsIS4_E4typeENS1_10locale_refEE14format_handler",
   "size" : 56,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "_ZTIPm"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail13compute_widthENS0_17basic_string_viewIcEEE17count_code_points",
   "name" : "count_code_points",
   "referenced_type" : "_ZTIZN3fmt3v106detail13compute_widthENS0_17basic_string_viewIcEEE17count_code_points",
   "self_type" : "_ZTIZN3fmt3v106detail13compute_widthENS0_17basic_string_viewIcEEE17count_code_points",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt3v106detail6bufferIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail13get_containerINS1_6bufferIcEEEERT_NSt3__120back_insert_iteratorIS5_EEE8accessor",
   "name" : "accessor",
   "referenced_type" : "_ZTIZN3fmt3v106detail13get_containerINS1_6bufferIcEEEERT_NSt3__120back_insert_iteratorIS5_EEE8accessor",
   "self_type" : "_ZTIZN3fmt3v106detail13get_containerINS1_6bufferIcEEEERT_NSt3__120back_insert_iteratorIS5_EEE8accessor",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler_",
     "referenced_type" : "_ZTIRZN3fmt3v106detail10vformat_toIcEEvRNS1_6bufferIT_EENS0_17basic_string_viewIS4_EENS1_12vformat_argsIS4_E4typeENS1_10locale_refEE14format_handler"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail19parse_format_stringILb0EcZNS1_10vformat_toIcEEvRNS1_6bufferIT_EENS0_17basic_string_viewIS5_EENS1_12vformat_argsIS5_E4typeENS1_10locale_refEE14format_handlerEEvNS8_IT0_EEOT1_E6writer",
   "name" : "writer",
   "referenced_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb0EcZNS1_10vformat_toIcEEvRNS1_6bufferIT_EENS0_17basic_string_viewIS5_EENS1_12vformat_argsIS5_E4typeENS1_10locale_refEE14format_handlerEEvNS8_IT0_EEOT1_E6writer",
   "self_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb0EcZNS1_10vformat_toIcEEvRNS1_6bufferIT_EENS0_17basic_string_viewIS5_EENS1_12vformat_argsIS5_E4typeENS1_10locale_refEE14format_handlerEEvNS8_IT0_EEOT1_E6writer",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler_",
     "referenced_type" : "_ZTIRN3fmt3v106detail21format_string_checkerIcJA7_ciEEE"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJA7_ciEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "name" : "writer",
   "referenced_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJA7_ciEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "self_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJA7_ciEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler_",
     "referenced_type" : "_ZTIRN3fmt3v106detail21format_string_checkerIcJEEE"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "name" : "writer",
   "referenced_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "self_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler_",
     "referenced_type" : "_ZTIRN3fmt3v106detail21format_string_checkerIcJNS0_17basic_string_viewIcEEA3_cEEE"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJNS0_17basic_string_viewIcEEA3_cEEEEEvNS4_IT0_EEOT1_E6writer",
   "name" : "writer",
   "referenced_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJNS0_17basic_string_viewIcEEA3_cEEEEEvNS4_IT0_EEOT1_E6writer",
   "self_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJNS0_17basic_string_viewIcEEA3_cEEEEEvNS4_IT0_EEOT1_E6writer",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler_",
     "referenced_type" : "_ZTIRN3fmt3v106detail21format_string_checkerIcJiEEE"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJiEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "name" : "writer",
   "referenced_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJiEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "self_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJiEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler_",
     "referenced_type" : "_ZTIRN3fmt3v106detail21format_string_checkerIcJjEEE"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJjEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "name" : "writer",
   "referenced_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJjEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "self_type" : "_ZTIZN3fmt3v106detail19parse_format_stringILb1EcNS1_21format_string_checkerIcJjEEEEEvNS0_17basic_string_viewIT0_EEOT1_E6writer",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRN3fmt3v106detail21format_string_checkerIcJA7_ciEEE"
    },
    {
     "field_name" : "arg_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJA7_ciEEEEEPKT_S9_S9_OT0_E10id_adapter",
   "name" : "id_adapter",
   "referenced_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJA7_ciEEEEEPKT_S9_S9_OT0_E10id_adapter",
   "self_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJA7_ciEEEEEPKT_S9_S9_OT0_E10id_adapter",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRN3fmt3v106detail21format_string_checkerIcJEEE"
    },
    {
     "field_name" : "arg_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJEEEEEPKT_S8_S8_OT0_E10id_adapter",
   "name" : "id_adapter",
   "referenced_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJEEEEEPKT_S8_S8_OT0_E10id_adapter",
   "self_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJEEEEEPKT_S8_S8_OT0_E10id_adapter",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRN3fmt3v106detail21format_string_checkerIcJNS0_17basic_string_viewIcEEA3_cEEE"
    },
    {
     "field_name" : "arg_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJNS0_17basic_string_viewIcEEA3_cEEEEEPKT_SB_SB_OT0_E10id_adapter",
   "name" : "id_adapter",
   "referenced_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJNS0_17basic_string_viewIcEEA3_cEEEEEPKT_SB_SB_OT0_E10id_adapter",
   "self_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJNS0_17basic_string_viewIcEEA3_cEEEEEPKT_SB_SB_OT0_E10id_adapter",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRN3fmt3v106detail21format_string_checkerIcJiEEE"
    },
    {
     "field_name" : "arg_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJiEEEEEPKT_S8_S8_OT0_E10id_adapter",
   "name" : "id_adapter",
   "referenced_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJiEEEEEPKT_S8_S8_OT0_E10id_adapter",
   "self_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJiEEEEEPKT_S8_S8_OT0_E10id_adapter",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRN3fmt3v106detail21format_string_checkerIcJjEEE"
    },
    {
     "field_name" : "arg_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJjEEEEEPKT_S8_S8_OT0_E10id_adapter",
   "name" : "id_adapter",
   "referenced_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJjEEEEEPKT_S8_S8_OT0_E10id_adapter",
   "self_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRNS1_21format_string_checkerIcJjEEEEEPKT_S8_S8_OT0_E10id_adapter",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRZN3fmt3v106detail10vformat_toIcEEvRNS1_6bufferIT_EENS0_17basic_string_viewIS4_EENS1_12vformat_argsIS4_E4typeENS1_10locale_refEE14format_handler"
    },
    {
     "field_name" : "arg_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRZNS1_10vformat_toIcEEvRNS1_6bufferIT_EENS0_17basic_string_viewIS5_EENS1_12vformat_argsIS5_E4typeENS1_10locale_refEE14format_handlerEEPKS5_SH_SH_OT0_E10id_adapter",
   "name" : "id_adapter",
   "referenced_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRZNS1_10vformat_toIcEEvRNS1_6bufferIT_EENS0_17basic_string_viewIS5_EENS1_12vformat_argsIS5_E4typeENS1_10locale_refEE14format_handlerEEPKS5_SH_SH_OT0_E10id_adapter",
   "self_type" : "_ZTIZN3fmt3v106detail23parse_replacement_fieldIcRZNS1_10vformat_toIcEEvRNS1_6bufferIT_EENS0_17basic_string_viewIS5_EENS1_12vformat_argsIS5_E4typeENS1_10locale_refEE14format_handlerEEPKS5_SH_SH_OT0_E10id_adapter",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail14compile_stringE"
    }
   ],
   "linker_set_key" : "_ZTIZZN3fmt3v106detail12fwrite_fullyEPKvmP7__sFILEENKUlvE_clEvE18FMT_COMPILE_STRING",
   "name" : "FMT_COMPILE_STRING",
   "referenced_type" : "_ZTIZZN3fmt3v106detail12fwrite_fullyEPKvmP7__sFILEENKUlvE_clEvE18FMT_COMPILE_STRING",
   "self_type" : "_ZTIZZN3fmt3v106detail12fwrite_fullyEPKvmP7__sFILEENKUlvE_clEvE18FMT_COMPILE_STRING",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail14compile_stringE"
    }
   ],
   "linker_set_key" : "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE0_clEvE18FMT_COMPILE_STRING",
   "name" : "FMT_COMPILE_STRING",
   "referenced_type" : "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE0_clEvE18FMT_COMPILE_STRING",
   "self_type" : "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE0_clEvE18FMT_COMPILE_STRING",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail14compile_stringE"
    }
   ],
   "linker_set_key" : "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE1_clEvE18FMT_COMPILE_STRING",
   "name" : "FMT_COMPILE_STRING",
   "referenced_type" : "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE1_clEvE18FMT_COMPILE_STRING",
   "self_type" : "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE1_clEvE18FMT_COMPILE_STRING",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail14compile_stringE"
    }
   ],
   "linker_set_key" : "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE_clEvE18FMT_COMPILE_STRING",
   "name" : "FMT_COMPILE_STRING",
   "referenced_type" : "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE_clEvE18FMT_COMPILE_STRING",
   "self_type" : "_ZTIZZNK3fmt3v109formatterINS0_6detail6bigintEcvE6formatERKS3_RNS0_20basic_format_contextINS0_8appenderEcEEENKUlvE_clEvE18FMT_COMPILE_STRING",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIOKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char>> &&",
